NextFOAM-24/tutorials/heatTransfer/solidFoam/movingCone/system/cuttingPlane
// -*- C++ -*-

cuttingPlane
{
    type            surfaces;
    libs            (sampling);

    writeControl    writeTime;

    surfaceFormat   vtk;
    fields          ( p U );

    interpolationScheme cellPoint;

    surfaces
    {
        zNormal
        {
            type        cuttingPlane;
            point       (0 0 0);
            normal      (0 0 1);
            interpolate true;
        }
    }
}


// ************************************************************************* //
